var reg=/\d+/;//\d代表0~9的数字，+代表1~多个 *代表0~多个 ?0~1次 {n}出现n次 {n,}至少出现n次  {n,m}出现n到m次
reg.test("123");//true  test是匹配
reg.exec("123");//  exec是捕获,前提是要匹配到，否则就是null

/* 正则的组成
元字符  /\d/在//里面的都是元字符
    量词元字符,特殊元字符,普通元字符
      特殊元字符
      \转义字符,可以把

修饰符 在//外面的都是修饰符 */

var reg=/\d?/;
reg.test("11w")


var reg=/^1[3-9]\d{9}$/;
reg.test("13341678911")

var reg=/([a-z][a-z])\1/;


// 月份
var reg=/^(0[1-9])|(1[0-2])$/
//日
var reg=/^(0[1-9])|([1-2][0-9])|(3[0-1])$/

//正则的正负向预查
/* 
(?=)正向预查/aa(?=da)/aa后必须跟da
(?!)负向预查/aa(?!da)/aa后不能跟da
*/

//0 -1 -1.2 3 4.6 3.1516
var reg=/^[+-]?((\d)|([1-9]\d+))(\.\d+)?$/
//名字最少有两个 .后最少有两个
var reg=/^[\u4E00-\u9FA5]{2,6}(·[\u4E00-\u9FA5]{2,6}){0,6}$/
reg.test("尼古拉斯·里杰·丽")

var reg=/^(?:\d{6})(\d{4})(\d{2})(\d{2})\d{2}(\d)(?:X|\d)$/
var aa=reg.exec("410621200009263518");
var str=""
if(aa[1]){
    str+=(aa[1]+"年");
    if(aa[2]){
        str+=(aa[2]+"月");
        if(aa[3]){
            str+=(aa[3]+"日");
            if(aa[4]%2==0){
                str+="女";
            }else{str+="男"}
        }
    }
}
console.log(str);

let str="aaa"
let reg=new RegExp(`^${str}$`);
console.log(reg);